emacs.org
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Config

Выполни ~org-babel-tangle~, чтобы записать блоки кода в init.el

** Базовые настройки и шрифт

#+begin_src emacs-lisp
(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

;; Set up the visible bell
(setq visible-bell t)

(set-face-attribute 'default nil :font "JetBrainsMono Nerd Font Mono" :height 150)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Открыть Emacs на весь экран при загрузке
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src


** Загрузка репозиториев и use-package

#+begin_src emacs-lisp
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src


** Ivy, бинды, swiper

#+begin_src emacs-lisp
(use-package swiper :ensure t)

(use-package ivy
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(global-set-key (kbd "C-M-j") 'counsel-switch-buffer)

(use-package ivy-rich
  :init (ivy-rich-mode 1))

(use-package counsel
  :ensure t
  :bind (("M-x" . counsel-M-x)
        ("C-x b" . counsel-ibuffer)
        ("C-x C-f" . counsel-find-file)
        :map minibuffer-local-map
        ("C-r" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

(use-package which-key
  :ensure t
  :init (which-key-mode)
  :config (setq which-key-idle-delay 0.2))
#+end_src


** Нумерация строк, окрашивание скобок, тема

#+begin_src emacs-lisp
(column-number-mode)
(global-display-line-numbers-mode t)
;; Disable line numbers for some modes
(dolist (mode '(term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package rainbow-delimiters)

(setq custom-safe-themes t)
(use-package doom-themes)
(load-theme 'doom-tomorrow-day)
#+end_src


** Пробел (Настроить!)

#+begin_src emacs-lisp
(use-package general)
  :config
  (general-create-definer rune/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

    (rune/leader-keys
    "t" '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme"))
#+end_src


** Evil-mode

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src


** Что-то для кодинга

Не знаю что это, разберусь, когда буду делать IDE.

#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Projects/")
    (setq projectile-project-search-path '("~/Projects/")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package simple-httpd
  :ensure t)
#+end_src


** Само сгенерировалось

#+begin_src emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-safe-themes
   '("e1f4f0158cd5a01a9d96f1f7cdcca8d6724d7d33267623cc433fe1c196848554" default))
 '(package-selected-packages
   '(htmlize org-roam-ui org-roam which-key simple-httpd rainbow-delimiters magit ivy-rich general exwm evil-collection doom-themes doom-modeline counsel-projectile)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+end_src


** ob-python

Проверить насколько это нужно, но вроде это чтобы выполнять python-код в блоках кода babel.

#+begin_src
 (require 'ob-python)
#+end_src


** eshell

Функция для открытия eshell в новом окне снизу и назначение горячей клавиши для открытия eshell в новом окне снизу.

#+begin_src emacs-lisp
(defun split-window-right-and-open-eshell ()
  "Split the window horizontally, focus the new window, and open eshell."
  (interactive)
  (split-window-below)
  (other-window 1)
  (eshell))

(global-set-key (kbd "C-c e") 'split-window-right-and-open-eshell)
#+end_src


** org-roam

#+begin_src emacs-lisp
(use-package org-roam
  :ensure t
  :custom
  (org-roam-directory "~/blog/content")
  (org-roam-capture-templates
   '(("b" "blog" plain
      "#+setupfile: setup.org\n#+date: %U\n#+excerpt: %?\n#+filetags:"
      :if-new (file+head "%<%Y-%m-%d>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
      ("a" "analysis" plain
      "#+setupfile: setup.org\n#+date: %U\n#+excerpt: %?\n#+filetags: :analysis:"
      :if-new (file+head "analysis/%<%Y-%m-%d>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert))
  :config
  (org-roam-setup))
#+end_src


** Публикация сайта

И бинд публикации сайта.

#+begin_src emacs-lisp
(require 'ox-publish)

(defun run-build ()
  "Run build.sh"
  (interactive)
  (let ((default-directory "~/blog/"))
    (shell-command "emacs -Q --script build.el")))

(global-set-key (kbd "C-c b") 'run-build)

#+end_src


** redo on c-r

Странно работает, отменяет на много шагов.

#+begin_src emacs-lisp
(use-package undo-tree
  :ensure t
  :after evil
  :diminish
  :config
  (evil-set-undo-system 'undo-tree)
  (global-undo-tree-mode 1))


(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)))
#+end_src


** Не спрашивать каждый раз, выполнить ли babel-буффер

#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src


** org-tempo

Чтобы быстро вставлять блоки кода с помощью синтаксиса ~<py + Tab~

#+begin_src emacs-lisp
(use-package org-tempo
  :ensure nil
  :demand t
  :config
  (dolist (item '(("sh" . "src sh")
                  ("el" . "src emacs-lisp")
                  ("li" . "src lisp")
                  ("py" . "src python")
                  ("yaml" . "src yaml")
                  ("json" . "src json")))
    (add-to-list 'org-structure-template-alist item)))
#+end_src


** org-modern

Не очень зашло, поэтому закомментировал.

#+begin_src emacs-lisp
;; (use-package org-modern
;;   :after org
;;   :hook (org-mode . org-modern-mode))
#+end_src
